In [74]:
import pandas as pd
import numpy as np

In [75]:
#create messey sample empolyee data
data ={
    "EmpId": [101, 102, "103", 104, 105, 106, 107, 108, 109, 110],
    "fullname": [
        " Alice Johnson ", "MICHEAL smith", "sarah lee", "David-Kim", None, "john brown",
        "Emma Wilson", "Tom  davis", "Jane Miller", "Chris taylor"
    ],
     "Dept": ["IT", "hr", "Mktng", "IT", "Customer Care", "marketing", "Finance", None, "HR", "marketing"],
    "Age": [29, "thirty-five", 26, 31, 42, 27, 33, 30, None, 28],
    "Salary($)": ["$5500.50", "4800", "4200.75", "Nan", "6100", "4,300", "5800", "5000", "4700.0", "4400"],
    "JoinDate": [
        "2021/04/12", "2020/11/01", "2022/01/18", "2019/9/25", "2018/07/05",
        "2021/10/14", "2019/12/01", "2020/03/22", "2021/05/10", "2022/02/05"
    ],
    "Performance": [ 87, "73", 90, 65, 82, 75, 88, None, "79%", "91"],
    "Remote?": ["Yes", "No", "Y", "N", "yes", "no", "Y", "Yes", None, "True"]


}

In [76]:
#create a dataframe for the data
df = pd.DataFrame(data)

#convert dataframe in csv file
df.to_csv("data/employee_dataset.csv", index=False)

#load dataset
df = pd.read_csv("data/employee_dataset.csv")
df

,EmpId,fullname,Dept,Age,Salary($),JoinDate,Performance,Remote?
0,101,Alice Johnson,IT,29,$5500.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020/11/01,73,No
2,103,sarah lee,Mktng,26,4200.75,2022/01/18,90,Y
3,104,David-Kim,IT,31,Nan,2019/9/25,65,N
4,105,NaN,Customer Care,42,6100,2018/07/05,82,yes
5,106,john brown,marketing,27,"4,300",2021/10/14,75,no
6,107,Emma Wilson,Finance,33,5800,2019/12/01,88,Y
7,108,Tom davis,NaN,30,5000,2020/03/22,NaN,Yes
8,109,Jane Miller,HR,NaN,4700.0,2021/05/10,79%,NaN
9,110,Chris taylor,marketing,28,4400,2022/02/05,91,True

In [77]:
#get the shape for the dataset
df.shape

(10, 8)

In [78]:
#get the information about dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmpId        10 non-null     int64
 1   fullname     9 non-null      object
 2   Dept         9 non-null      object
 3   Age          9 non-null      object
 4   Salary($)    10 non-null     object
 5   JoinDate     10 non-null     object
 6   Performance  9 non-null      object
 7   Remote?      9 non-null      object
dtypes: int64(1), object(7)
memory usage: 772.0+ bytes

In [79]:
#get the first five rows
df.head()

,EmpId,fullname,Dept,Age,Salary($),JoinDate,Performance,Remote?
0,101,Alice Johnson,IT,29,$5500.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020/11/01,73,No
2,103,sarah lee,Mktng,26,4200.75,2022/01/18,90,Y
3,104,David-Kim,IT,31,Nan,2019/9/25,65,N
4,105,NaN,Customer Care,42,6100,2018/07/05,82,yes

In [80]:
#get the dataset columns
df.columns

Index(['EmpId', 'fullname', 'Dept', 'Age', 'Salary($)', 'JoinDate',
       'Performance', 'Remote?'],
      dtype='object')

In [81]:
#check for missing values
df.isnull().sum()

EmpId          0
fullname       1
Dept           1
Age            1
Salary($)      0
JoinDate       0
Performance    1
Remote?        1
dtype: int64

In [82]:
#inspect the unique values columns
print(df['Dept'].unique())
print(df['Age'].unique())
print(df['Remote?'].unique())

['IT' 'hr' 'Mktng' 'Customer Care' 'marketing' 'Finance' nan 'HR']
['29' 'thirty-five' '26' '31' '42' '27' '33' '30' nan '28']
['Yes' 'No' 'Y' 'N' 'yes' 'no' nan 'True']

In [83]:
#access series data
df['Salary($)'].tolist()

['$5500.50',
 '4800',
 '4200.75',
 'Nan',
 '6100',
 '4,300',
 '5800',
 '5000',
 '4700.0',
 '4400']

In [84]:
df['fullname'].tolist()

[' Alice Johnson ',
 'MICHEAL smith',
 'sarah lee',
 'David-Kim',
 nan,
 'john brown',
 'Emma Wilson',
 'Tom  davis',
 'Jane Miller',
 'Chris taylor']

In [85]:
df['Salary($)'].head()

0    $5500.50
1        4800
2     4200.75
3         Nan
4        6100
Name: Salary($), dtype: object

In [86]:
#start cleaning inconsistent values
# rename inconsistence columns
df.rename(columns={
    'EmpId': 'emp_id',
    'fullname': 'full_name',
    'Dept': 'department',
    'Age': 'age',
    'Salary($)': 'salary',
    'JoinDate': 'join_date',
    'Performance': 'performance',
    'Remote?': 'remote'
}, inplace=True)

df

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29,$5500.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020/11/01,73,No
2,103,sarah lee,Mktng,26,4200.75,2022/01/18,90,Y
3,104,David-Kim,IT,31,Nan,2019/9/25,65,N
4,105,NaN,Customer Care,42,6100,2018/07/05,82,yes
5,106,john brown,marketing,27,"4,300",2021/10/14,75,no
6,107,Emma Wilson,Finance,33,5800,2019/12/01,88,Y
7,108,Tom davis,NaN,30,5000,2020/03/22,NaN,Yes
8,109,Jane Miller,HR,NaN,4700.0,2021/05/10,79%,NaN
9,110,Chris taylor,marketing,28,4400,2022/02/05,91,True

In [87]:
#clean inconsistent values in full_name
df['full_name'] = df['full_name'].str.strip()
df['full_name'] = df['full_name'].str.title()
df['full_name'] = df['full_name'].str.replace(r'\s+', " ", regex=True)
df['full_name'] = df['full_name'].str.replace('-', " ")
df['full_name'].tolist()

['Alice Johnson',
 'Micheal Smith',
 'Sarah Lee',
 'David Kim',
 nan,
 'John Brown',
 'Emma Wilson',
 'Tom Davis',
 'Jane Miller',
 'Chris Taylor']

In [88]:
#clean inconsistent values in department
df['department'].replace({
    'hr': 'HR',
    'Mktng': 'Marketing',
    'marketing': 'Marketing',
    
}, inplace=True)
df['department']

C:\Users\ayode\AppData\Local\Temp\ipykernel_16796\1476772039.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['department'].replace({

0               IT
1               HR
2        Marketing
3               IT
4    Customer Care
5        Marketing
6          Finance
7              NaN
8               HR
9        Marketing
Name: department, dtype: object

In [89]:
#clean inconsistent values in age
def clean_age(value):
    if value == 'thirty-five':
        return 35
    elif isinstance(value, (int, float)):
        return value
    elif isinstance(value, str) and value.isdigit():
        return int(value)
    else:
       return np.nan
df['age'] = df['age'].apply(clean_age)
df['age']

0    29.0
1    35.0
2    26.0
3    31.0
4    42.0
5    27.0
6    33.0
7    30.0
8     NaN
9    28.0
Name: age, dtype: float64

In [90]:
#clean inconsistent value in salary column
df['salary'] = (
    df['salary']
    .astype(str)
    .replace('[$,]', "", regex=True)
    .replace("Nan", np.nan)
    .astype(float)

)
df['salary']

0    5500.50
1    4800.00
2    4200.75
3        NaN
4    6100.00
5    4300.00
6    5800.00
7    5000.00
8    4700.00
9    4400.00
Name: salary, dtype: float64

In [91]:
#clean inconsistent value in join-date column
df['join_date'] = pd.to_datetime(df['join_date'], errors="coerce")
df['join_date']

0   2021-04-12
1   2020-11-01
2   2022-01-18
3   2019-09-25
4   2018-07-05
5   2021-10-14
6   2019-12-01
7   2020-03-22
8   2021-05-10
9   2022-02-05
Name: join_date, dtype: datetime64[ns]

In [92]:
#clean inconsistent value in performance column
df['performance'] = (
    df['performance']
    .astype(str)
    .str.replace('%', "", regex=False)
    .replace("None", np.nan)
    .astype(float)

)
df['performance']

0    87.0
1    73.0
2    90.0
3    65.0
4    82.0
5    75.0
6    88.0
7     NaN
8    79.0
9    91.0
Name: performance, dtype: float64

In [93]:
#clean inconsistent value in remote column
df['remote'].replace({
    'Y': 'Yes',
    'N': 'No',
    'yes': 'Yes',
    'no': 'No',
    "True": 'Yes',
    "None": np.nan
}, inplace=True)
df['remote']

C:\Users\ayode\AppData\Local\Temp\ipykernel_16796\3630628167.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['remote'].replace({

0    Yes
1     No
2    Yes
3     No
4    Yes
5     No
6    Yes
7    Yes
8    NaN
9    Yes
Name: remote, dtype: object

In [94]:
#clean inconsistent value in emp_id column
df['emp_id'] = pd.to_numeric(df['emp_id'], errors='coerce')
df['emp_id']

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
Name: emp_id, dtype: int64

In [95]:
#check the data info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   emp_id       10 non-null     int64
 1   full_name    9 non-null      object
 2   department   9 non-null      object
 3   age          9 non-null      float64
 4   salary       9 non-null      float64
 5   join_date    10 non-null     datetime64[ns]
 6   performance  9 non-null      float64
 7   remote       9 non-null      object
dtypes: datetime64[ns](1), float64(3), int64(1), object(3)
memory usage: 772.0+ bytes

In [96]:
#hnadle missing value
df['full_name'] = df['full_name'].fillna('Unknown')
df['full_name']

0    Alice Johnson
1    Micheal Smith
2        Sarah Lee
3        David Kim
4          Unknown
5       John Brown
6      Emma Wilson
7        Tom Davis
8      Jane Miller
9     Chris Taylor
Name: full_name, dtype: object

In [97]:
df['department'] = df['department'].fillna(df['department'].mode()[0])
df['department']

0               IT
1               HR
2        Marketing
3               IT
4    Customer Care
5        Marketing
6          Finance
7        Marketing
8               HR
9        Marketing
Name: department, dtype: object

In [98]:
df['age'] = df['age'].fillna(df['age'].median())
df['age']

0    29.0
1    35.0
2    26.0
3    31.0
4    42.0
5    27.0
6    33.0
7    30.0
8    30.0
9    28.0
Name: age, dtype: float64

In [99]:
df['salary'] = df['salary'].fillna(df['salary'].median())
df['salary']

0    5500.50
1    4800.00
2    4200.75
3    4800.00
4    6100.00
5    4300.00
6    5800.00
7    5000.00
8    4700.00
9    4400.00
Name: salary, dtype: float64

In [100]:
df['performance'] = df['performance'].fillna(df['performance'].median())
df['performance']

0    87.0
1    73.0
2    90.0
3    65.0
4    82.0
5    75.0
6    88.0
7    82.0
8    79.0
9    91.0
Name: performance, dtype: float64

In [101]:
df['remote'] = df['remote'].fillna(df['remote'].mode()[0])
df['remote']

0    Yes
1     No
2    Yes
3     No
4    Yes
5     No
6    Yes
7    Yes
8    Yes
9    Yes
Name: remote, dtype: object

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   emp_id       10 non-null     int64
 1   full_name    10 non-null     object
 2   department   10 non-null     object
 3   age          10 non-null     float64
 4   salary       10 non-null     float64
 5   join_date    10 non-null     datetime64[ns]
 6   performance  10 non-null     float64
 7   remote       10 non-null     object
dtypes: datetime64[ns](1), float64(3), int64(1), object(3)
memory usage: 772.0+ bytes

In [103]:
#working with filter data
df.head()

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes
1,102,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes
3,104,David Kim,IT,31.0,4800.00,2019-09-25,65.0,No
4,105,Unknown,Customer Care,42.0,6100.00,2018-07-05,82.0,Yes

In [104]:
df['full_name']

0    Alice Johnson
1    Micheal Smith
2        Sarah Lee
3        David Kim
4          Unknown
5       John Brown
6      Emma Wilson
7        Tom Davis
8      Jane Miller
9     Chris Taylor
Name: full_name, dtype: object

In [105]:
df[['full_name', 'salary', 'performance']]

       full_name   salary  performance
0  Alice Johnson  5500.50         87.0
1  Micheal Smith  4800.00         73.0
2      Sarah Lee  4200.75         90.0
3      David Kim  4800.00         65.0
4        Unknown  6100.00         82.0
5     John Brown  4300.00         75.0
6    Emma Wilson  5800.00         88.0
7      Tom Davis  5000.00         82.0
8    Jane Miller  4700.00         79.0
9   Chris Taylor  4400.00         91.0

In [106]:
df.iloc[0:3, 0:3]

   emp_id      full_name department
0     101  Alice Johnson         IT
1     102  Micheal Smith         HR
2     103      Sarah Lee  Marketing

In [107]:
df.iloc[0:3]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes
1,102,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes

In [108]:
df.loc[df['salary'] >= 5000]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5500.5,2021-04-12,87.0,Yes
4,105,Unknown,Customer Care,42.0,6100.0,2018-07-05,82.0,Yes
6,107,Emma Wilson,Finance,33.0,5800.0,2019-12-01,88.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.0,2020-03-22,82.0,Yes

In [109]:
df.loc[df['salary'] >= 5000]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5500.5,2021-04-12,87.0,Yes
4,105,Unknown,Customer Care,42.0,6100.0,2018-07-05,82.0,Yes
6,107,Emma Wilson,Finance,33.0,5800.0,2019-12-01,88.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.0,2020-03-22,82.0,Yes

In [110]:
df.loc[df['salary'] >= 5000, ['full_name', 'department']]

       full_name     department
0  Alice Johnson             IT
4        Unknown  Customer Care
6    Emma Wilson        Finance
7      Tom Davis      Marketing

In [111]:
df[df['department'] == 'IT']

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5500.5,2021-04-12,87.0,Yes
3,104,David Kim,IT,31.0,4800.0,2019-09-25,65.0,No

In [112]:
df[df['age'] > 30]

,emp_id,full_name,department,age,salary,join_date,performance,remote
1,102,Micheal Smith,HR,35.0,4800.0,2020-11-01,73.0,No
3,104,David Kim,IT,31.0,4800.0,2019-09-25,65.0,No
4,105,Unknown,Customer Care,42.0,6100.0,2018-07-05,82.0,Yes
6,107,Emma Wilson,Finance,33.0,5800.0,2019-12-01,88.0,Yes

In [113]:
df[df['department'] != 'HR']

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes
3,104,David Kim,IT,31.0,4800.00,2019-09-25,65.0,No
4,105,Unknown,Customer Care,42.0,6100.00,2018-07-05,82.0,Yes
5,106,John Brown,Marketing,27.0,4300.00,2021-10-14,75.0,No
6,107,Emma Wilson,Finance,33.0,5800.00,2019-12-01,88.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes
9,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes

In [114]:
df[
    (df['salary'] > 4000) & (df['remote'] == 'Yes')
    ]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes
4,105,Unknown,Customer Care,42.0,6100.00,2018-07-05,82.0,Yes
6,107,Emma Wilson,Finance,33.0,5800.00,2019-12-01,88.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes
8,109,Jane Miller,HR,30.0,4700.00,2021-05-10,79.0,Yes
9,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes

In [115]:
df[df['department'].isin(['IT', 'Finance'])]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5500.5,2021-04-12,87.0,Yes
3,104,David Kim,IT,31.0,4800.0,2019-09-25,65.0,No
6,107,Emma Wilson,Finance,33.0,5800.0,2019-12-01,88.0,Yes

In [116]:
df[df['full_name'].str.contains('john', case=False)]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5500.5,2021-04-12,87.0,Yes
5,106,John Brown,Marketing,27.0,4300.0,2021-10-14,75.0,No

In [117]:
df[df['department'].str.startswith('M')]

,emp_id,full_name,department,age,salary,join_date,performance,remote
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes
5,106,John Brown,Marketing,27.0,4300.00,2021-10-14,75.0,No
7,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes
9,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes

In [118]:
df[
    (df['join_date'] > '2019-01-01') & (df['join_date'] < '2021-12-13')
    ]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5500.5,2021-04-12,87.0,Yes
1,102,Micheal Smith,HR,35.0,4800.0,2020-11-01,73.0,No
3,104,David Kim,IT,31.0,4800.0,2019-09-25,65.0,No
5,106,John Brown,Marketing,27.0,4300.0,2021-10-14,75.0,No
6,107,Emma Wilson,Finance,33.0,5800.0,2019-12-01,88.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.0,2020-03-22,82.0,Yes
8,109,Jane Miller,HR,30.0,4700.0,2021-05-10,79.0,Yes

In [119]:
#working with sorts
df.sort_values('salary', ascending=False)

,emp_id,full_name,department,age,salary,join_date,performance,remote
4,105,Unknown,Customer Care,42.0,6100.00,2018-07-05,82.0,Yes
6,107,Emma Wilson,Finance,33.0,5800.00,2019-12-01,88.0,Yes
0,101,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes
1,102,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No
3,104,David Kim,IT,31.0,4800.00,2019-09-25,65.0,No
8,109,Jane Miller,HR,30.0,4700.00,2021-05-10,79.0,Yes
9,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes
5,106,John Brown,Marketing,27.0,4300.00,2021-10-14,75.0,No
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes

In [120]:
df.sort_values('performance', ascending=False)

,emp_id,full_name,department,age,salary,join_date,performance,remote
9,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes
6,107,Emma Wilson,Finance,33.0,5800.00,2019-12-01,88.0,Yes
0,101,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes
4,105,Unknown,Customer Care,42.0,6100.00,2018-07-05,82.0,Yes
8,109,Jane Miller,HR,30.0,4700.00,2021-05-10,79.0,Yes
5,106,John Brown,Marketing,27.0,4300.00,2021-10-14,75.0,No
1,102,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No
3,104,David Kim,IT,31.0,4800.00,2019-09-25,65.0,No

In [121]:
df.sort_values(['department', 'salary'], ascending=[True, False])

,emp_id,full_name,department,age,salary,join_date,performance,remote
4,105,Unknown,Customer Care,42.0,6100.00,2018-07-05,82.0,Yes
6,107,Emma Wilson,Finance,33.0,5800.00,2019-12-01,88.0,Yes
1,102,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No
8,109,Jane Miller,HR,30.0,4700.00,2021-05-10,79.0,Yes
0,101,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes
3,104,David Kim,IT,31.0,4800.00,2019-09-25,65.0,No
7,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes
9,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes
5,106,John Brown,Marketing,27.0,4300.00,2021-10-14,75.0,No
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes

In [122]:
#working with value count 
df['department'].value_counts()

department
Marketing        4
IT               2
HR               2
Customer Care    1
Finance          1
Name: count, dtype: int64

In [123]:
df['department'].value_counts(normalize=True)

department
Marketing        0.4
IT               0.2
HR               0.2
Customer Care    0.1
Finance          0.1
Name: proportion, dtype: float64

In [124]:
df['remote'].value_counts(normalize=True)

remote
Yes    0.7
No     0.3
Name: proportion, dtype: float64

In [125]:
#working with pandas merge 
data1 = {
    "department": ["IT", "HR", "Finance", "Marketing", "R&D", "Operations", "Sales", "Logistics", "Procurement", "Customer Service"],
    "manager": [
        "Tom Hanks", "Susan Lee", "Robert Miles",
        "Mark Chan", "Sarah Connor", "James Nwosu", "Adaeze Obi",
        "Daniel Smith", "Amina Yusuf", "Grace Ojo"
    ],
    "department_budget": [200000, 150000, 250000, 180000, 300000, 220000, 210000, 195000, 230000, 170000],
"office_location": [
    "Lagos", "Abuja", "Port Hatcourt", "Ibadan", "Enugu", "Kano", 
    "Lagos", "Calabar", "Abuja", "Kano"
]
}

df1 = pd.DataFrame(data1)

df1.to_csv("data/department_data.csv", index=False)

df1 = pd.read_csv("data/department_data.csv")

df1.head(10)

         department       manager  department_budget office_location
0                IT     Tom Hanks             200000           Lagos
1                HR     Susan Lee             150000           Abuja
2           Finance  Robert Miles             250000   Port Hatcourt
3         Marketing     Mark Chan             180000          Ibadan
4               R&D  Sarah Connor             300000           Enugu
5        Operations   James Nwosu             220000            Kano
6             Sales    Adaeze Obi             210000           Lagos
7         Logistics  Daniel Smith             195000         Calabar
8       Procurement   Amina Yusuf             230000           Abuja
9  Customer Service     Grace Ojo             170000            Kano

In [126]:
merge_df=pd.merge(df, df1, how='inner')
merge_df

,emp_id,full_name,department,age,salary,join_date,performance,remote,manager,department_budget,office_location
0,101,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes,Tom Hanks,200000,Lagos
1,102,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No,Susan Lee,150000,Abuja
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes,Mark Chan,180000,Ibadan
3,104,David Kim,IT,31.0,4800.00,2019-09-25,65.0,No,Tom Hanks,200000,Lagos
4,106,John Brown,Marketing,27.0,4300.00,2021-10-14,75.0,No,Mark Chan,180000,Ibadan
5,107,Emma Wilson,Finance,33.0,5800.00,2019-12-01,88.0,Yes,Robert Miles,250000,Port Hatcourt
6,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes,Mark Chan,180000,Ibadan
7,109,Jane Miller,HR,30.0,4700.00,2021-05-10,79.0,Yes,Susan Lee,150000,Abuja
8,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes,Mark Chan,180000,Ibadan

In [127]:
left_df=pd.merge(df, df1, how='left')
left_df

,emp_id,full_name,department,age,salary,join_date,performance,remote,manager,department_budget,office_location
0,101,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes,Tom Hanks,200000.0,Lagos
1,102,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No,Susan Lee,150000.0,Abuja
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes,Mark Chan,180000.0,Ibadan
3,104,David Kim,IT,31.0,4800.00,2019-09-25,65.0,No,Tom Hanks,200000.0,Lagos
4,105,Unknown,Customer Care,42.0,6100.00,2018-07-05,82.0,Yes,NaN,NaN,NaN
5,106,John Brown,Marketing,27.0,4300.00,2021-10-14,75.0,No,Mark Chan,180000.0,Ibadan
6,107,Emma Wilson,Finance,33.0,5800.00,2019-12-01,88.0,Yes,Robert Miles,250000.0,Port Hatcourt
7,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes,Mark Chan,180000.0,Ibadan
8,109,Jane Miller,HR,30.0,4700.00,2021-05-10,79.0,Yes,Susan Lee,150000.0,Abuja
9,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes,Mark Chan,180000.0,Ibadan

In [128]:
right_df=pd.merge(df, df1, how='right')
right_df

,emp_id,full_name,department,age,salary,join_date,performance,remote,manager,department_budget,office_location
0,101.0,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes,Tom Hanks,200000,Lagos
1,104.0,David Kim,IT,31.0,4800.00,2019-09-25,65.0,No,Tom Hanks,200000,Lagos
2,102.0,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No,Susan Lee,150000,Abuja
3,109.0,Jane Miller,HR,30.0,4700.00,2021-05-10,79.0,Yes,Susan Lee,150000,Abuja
4,107.0,Emma Wilson,Finance,33.0,5800.00,2019-12-01,88.0,Yes,Robert Miles,250000,Port Hatcourt
5,103.0,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes,Mark Chan,180000,Ibadan
6,106.0,John Brown,Marketing,27.0,4300.00,2021-10-14,75.0,No,Mark Chan,180000,Ibadan
7,108.0,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes,Mark Chan,180000,Ibadan
8,110.0,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes,Mark Chan,180000,Ibadan
9,NaN,NaN,R&D,NaN,NaN,NaT,NaN,NaN,Sarah Connor,300000,Enugu
10,NaN,NaN,Operations,NaN,NaN,NaT,NaN,NaN,James Nwosu,220000,Kano
11,NaN,NaN,Sales,NaN,NaN,NaT,NaN,NaN,Adaeze Obi,210000,Lagos
12,NaN,NaN,Logistics,NaN,NaN,NaT,NaN,NaN,Daniel Smith,195000,Calabar
13,NaN,NaN,Procurement,NaN,NaN,NaT,NaN,NaN,Amina Yusuf,230000,Abuja
14,NaN,NaN,Customer Service,NaN,NaN,NaT,NaN,NaN,Grace Ojo,170000,Kano

In [129]:
print(merge_df['salary'].mean())

4833.472222222223

In [130]:
#average salary by department
merge_df.groupby('department')['salary'].mean().sort_values(ascending=False)

department
Finance      5800.0000
IT           5150.2500
HR           4750.0000
Marketing    4475.1875
Name: salary, dtype: float64

In [131]:
#average performance by department 
merge_df.groupby('department')['performance'].mean().sort_values(ascending=False)

department
Finance      88.0
Marketing    84.5
HR           76.0
IT           76.0
Name: performance, dtype: float64

In [132]:
#average performnce by department and remote
merge_df.groupby(['department', 'remote'])['performance'].mean().sort_values(ascending=False)

department  remote
Finance     Yes       88.000000
Marketing   Yes       87.666667
IT          Yes       87.000000
HR          Yes       79.000000
Marketing   No        75.000000
HR          No        73.000000
IT          No        65.000000
Name: performance, dtype: float64

In [133]:
#working with multiple aggregation
merge_df.groupby('department')['salary'].agg({'mean', 'count', 'min', 'max'})

                 mean  count     max      min
department
Finance     5800.0000      1  5800.0  5800.00
HR          4750.0000      2  4800.0  4700.00
IT          5150.2500      2  5500.5  4800.00
Marketing   4475.1875      4  5000.0  4200.75

In [134]:
#group multiple columns apply to several
merge_df.groupby('department')[['salary', 'performance']].mean()

               salary  performance
department
Finance     5800.0000         88.0
HR          4750.0000         76.0
IT          5150.2500         76.0
Marketing   4475.1875         84.5

In [135]:
merge_df.groupby('department').agg(
    avg_salary=('salary', 'mean'),
    highest_salary=('salary', 'max'),
    lowest_salary=('salary', 'min'),
    employee_count=('salary', 'count')
)

            avg_salary  highest_salary  lowest_salary  employee_count
department
Finance      5800.0000          5800.0        5800.00               1
HR           4750.0000          4800.0        4700.00               2
IT           5150.2500          5500.5        4800.00               2
Marketing    4475.1875          5000.0        4200.75               4

In [136]:
merge_df.groupby('department').agg(
    avg_salary=('salary', 'mean'),
    total_employee=('emp_id', 'count'),
    avg_performance=('performance', 'mean')
)

            avg_salary  total_employee  avg_performance
department
Finance      5800.0000               1             88.0
HR           4750.0000               2             76.0
IT           5150.2500               2             76.0
Marketing    4475.1875               4             84.5

In [137]:
merge_df.groupby('department')['salary'].mean().reset_index()

  department     salary
0    Finance  5800.0000
1         HR  4750.0000
2         IT  5150.2500
3  Marketing  4475.1875

In [138]:
merge_df.groupby('department')['salary'].apply(lambda x: x.std())

department
Finance             NaN
HR            70.710678
IT           495.328300
Marketing    359.206497
Name: salary, dtype: float64

In [140]:
merge_df.groupby('department').filter(lambda x: x['salary'].mean() > 5000)

,emp_id,full_name,department,age,salary,join_date,performance,remote,manager,department_budget,office_location
0,101,Alice Johnson,IT,29.0,5500.5,2021-04-12,87.0,Yes,Tom Hanks,200000,Lagos
3,104,David Kim,IT,31.0,4800.0,2019-09-25,65.0,No,Tom Hanks,200000,Lagos
5,107,Emma Wilson,Finance,33.0,5800.0,2019-12-01,88.0,Yes,Robert Miles,250000,Port Hatcourt

In [142]:
merge_df['department_avg_salary'] = merge_df.groupby('department')['salary'].transform('mean')
merge_df

,emp_id,full_name,department,age,salary,join_date,performance,remote,manager,department_budget,office_location,department_avg_salary
0,101,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes,Tom Hanks,200000,Lagos,5150.2500
1,102,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No,Susan Lee,150000,Abuja,4750.0000
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes,Mark Chan,180000,Ibadan,4475.1875
3,104,David Kim,IT,31.0,4800.00,2019-09-25,65.0,No,Tom Hanks,200000,Lagos,5150.2500
4,106,John Brown,Marketing,27.0,4300.00,2021-10-14,75.0,No,Mark Chan,180000,Ibadan,4475.1875
5,107,Emma Wilson,Finance,33.0,5800.00,2019-12-01,88.0,Yes,Robert Miles,250000,Port Hatcourt,5800.0000
6,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes,Mark Chan,180000,Ibadan,4475.1875
7,109,Jane Miller,HR,30.0,4700.00,2021-05-10,79.0,Yes,Susan Lee,150000,Abuja,4750.0000
8,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes,Mark Chan,180000,Ibadan,4475.1875

In [145]:
merge_df.groupby('department')['salary'].apply(lambda x: x.max()- x.min())

department
Finance        0.00
HR           100.00
IT           700.50
Marketing    799.25
Name: salary, dtype: float64